Revit 2027 API
FabricAreaType.CreateDefaultFabricAreaType Method
 Creates a new FabricAreaType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultFabricAreaType(
	Document aDoc
)
Public Shared Function CreateDefaultFabricAreaType (
	aDoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultFabricAreaType(
	Document^ aDoc
)
static member CreateDefaultFabricAreaType :
        aDoc : Document -> ElementId
Parameters
aDoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricAreaType Class
Autodesk.Revit.DB.Structure Namespace